# Groupby

In [1]:
import pandas as pd

var = pd.DataFrame({
    "name": ['a', 'b', 'c', 'd', 'a', 'b', 'b', 'd', 'd', 'c', 'a'],
    "s1" : [12, 8, 11, 17, 14, 11, 13, 17, 18, 18, 16],
    "s2" : [16, 13, 11, 18, 18, 13, 15, 18, 19, 17, 16]
})
var

   name  s1  s2
0     a  12  16
1     b   8  13
2     c  11  11
3     d  17  18
4     a  14  18
5     b  11  13
6     b  13  15
7     d  17  18
8     d  18  19
9     c  18  17
10    a  16  16

In [2]:
var_new = var.groupby("name")
var_new

In [3]:
for x, y in var_new:
    print(x)
    print(y)
    print()

a
   name  s1  s2
0     a  12  16
4     a  14  18
10    a  16  16

b
  name  s1  s2
1    b   8  13
5    b  11  13
6    b  13  15

c
  name  s1  s2
2    c  11  11
9    c  18  17

d
  name  s1  s2
3    d  17  18
7    d  17  18
8    d  18  19

In [4]:
var_new.get_group("a")

   name  s1  s2
0     a  12  16
4     a  14  18
10    a  16  16

In [5]:
var_new.min()

      s1  s2
name
a     12  16
b      8  13
c     11  11
d     17  18

In [6]:
var_new.max()

      s1  s2
name
a     16  18
b     13  15
c     18  17
d     18  19

In [7]:
var_new.mean()

             s1         s2
name
a     14.000000  16.666667
b     10.666667  13.666667
c     14.500000  14.000000
d     17.333333  18.333333

In [8]:
li = list(var_new)
li

[('a',
     name  s1  s2
  0     a  12  16
  4     a  14  18
  10    a  16  16),
 ('b',
    name  s1  s2
  1    b   8  13
  5    b  11  13
  6    b  13  15),
 ('c',
    name  s1  s2
  2    c  11  11
  9    c  18  17),
 ('d',
    name  s1  s2
  3    d  17  18
  7    d  17  18
  8    d  18  19)]